Test/TestResult/10000/WasmEdge10000JIT.txt
hey -n 10000 http://0.0.0.0:8080/

Summary:
  Total:        16.5397 secs
  Slowest:      0.1528 secs
  Fastest:      0.0316 secs
  Average:      0.0825 secs
  Requests/sec: 604.6064

  Total data:   60000 bytes
  Size/request: 6 bytes

Response time histogram:
  0.032 [1]     |
  0.044 [7]     |
  0.056 [9]     |
  0.068 [8]     |
  0.080 [4094]  |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.092 [5206]  |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.104 [425]   |■■■
  0.116 [54]    |
  0.129 [84]    |■
  0.141 [81]    |■
  0.153 [31]    |


Latency distribution:
  10% in 0.0737 secs
  25% in 0.0768 secs
  50% in 0.0814 secs
  75% in 0.0855 secs
  90% in 0.0898 secs
  95% in 0.0945 secs
  99% in 0.1327 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0316 secs, 0.1528 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0022 secs
  resp wait:    0.0823 secs, 0.0311 secs, 0.1525 secs
  resp read:    0.0001 secs, 0.0000 secs, 0.0012 secs

Status code distribution:
  [200] 10000 responses