Test/TestResult/10000/Wasmtime10000AOT.txt
hey -n 10000 http://0.0.0.0:8080

Summary:
  Total:        1.2570 secs
  Slowest:      0.0168 secs
  Fastest:      0.0002 secs
  Average:      0.0062 secs
  Requests/sec: 7955.2792


Response time histogram:
  0.000 [1]     |
  0.002 [208]   |■■■
  0.004 [1121]  |■■■■■■■■■■■■■■■■
  0.005 [2146]  |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.007 [2870]  |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.008 [1993]  |■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.010 [1126]  |■■■■■■■■■■■■■■■■
  0.012 [424]   |■■■■■■
  0.013 [83]    |■
  0.015 [19]    |
  0.017 [9]     |


Latency distribution:
  10% in 0.0032 secs
  25% in 0.0045 secs
  50% in 0.0061 secs
  75% in 0.0077 secs
  90% in 0.0093 secs
  95% in 0.0102 secs
  99% in 0.0119 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0002 secs, 0.0168 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0017 secs
  resp wait:    0.0061 secs, 0.0002 secs, 0.0167 secs
  resp read:    0.0000 secs, 0.0000 secs, 0.0014 secs

Status code distribution:
  [200] 10000 responses