Test/TestResult/10000/Wasmtime10000JIT.txt
hey -n 10000 http://0.0.0.0:8080

Summary:
  Total:        1.2027 secs
  Slowest:      0.0160 secs
  Fastest:      0.0003 secs
  Average:      0.0059 secs
  Requests/sec: 8314.7699


Response time histogram:
  0.000 [1]     |
  0.002 [301]   |■■■■
  0.003 [1182]  |■■■■■■■■■■■■■■■■■
  0.005 [2180]  |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.007 [2768]  |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.008 [1960]  |■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.010 [987]   |■■■■■■■■■■■■■■
  0.011 [444]   |■■■■■■
  0.013 [141]   |■■
  0.014 [25]    |
  0.016 [11]    |


Latency distribution:
  10% in 0.0030 secs
  25% in 0.0043 secs
  50% in 0.0058 secs
  75% in 0.0073 secs
  90% in 0.0090 secs
  95% in 0.0100 secs
  99% in 0.0119 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0003 secs, 0.0160 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0009 secs
  resp wait:    0.0058 secs, 0.0003 secs, 0.0160 secs
  resp read:    0.0000 secs, 0.0000 secs, 0.0018 secs

Status code distribution:
  [200] 10000 responses